'''
파이썬(Python)
    귀도 반 로썸(Guido van Rossum)에 의해 개발된 고급 프로그래밍 언어.
    배우기 쉬운 동시에 속도도 빠르며 다양한 확장성을 가짐.
    파이썬은 자바처럼 다양한 플랫폼에서 사용할 수 있으며,
    라이브러리(모듈)가 풍부하기 때문에 손쉬운 사용과 빠른 개발속도가 큰 장점.
    
    1. 간결한 코드 (본래 교육용으로 만들어진 언어)
    
    2. 들여쓰기 (들여쓰기로 블록을 구분 / 들여쓰기가 달라지면 다른 블록으로 인식)
    
       C/C++ 이나 JAVA와 같은 경우에는 중괄호{} 를 사용하여 블록을 구분.
       
    3. 인터프리터 언어 (인터프리터(해석기) 위에서 실행되는 언어)
    
       프로그램의 코드가 한 라인씩 순서대로 해석되고 실행되기를 반복.
       따라서 코드가 완전히 작성되지 않아도 작성된 부분까지 테스트를 위해 실행 가능.

    4. 멀티 패러다임
    
       절차지향 패러다임(C언어), 객체지향 패러다임(Java), 함수형 패러다임(LISP)
       파이썬은 이런 패러다임에 구애받지 않고 상황에 맞는 유연한 코딩 가능.

파이썬 버전(2.X버전 / 3.X버전) 호환성 문제
    파이썬 2.X버전을 기준으로 개발된 다양한 라이브러리를 3.X버전에서는 사용하지 못하는 경우가 많다.
    
'''
